<?php
function presloviCIR($text) {
 
    /* Ако постоји унос постави унос као $text. */
   
        /* Ћирилични низ */
        $cirilica = array ('ђ','љ','њ','џ','Љ','Њ','Џ','а','б','в','г','д','ђ','е','ж','з','и','ј','к','л','м','н','о','п','р','с','т','ћ','у','ф','х','ц','ч','ш','А','Б','В','Г','Д','Ђ','Е','Ж','З','И','Ј','К','Л','М','Н','О','П','Р','С','Т','Ћ','У','Ф','Х','Ц','Ч','Ш');
     
        /* Латинични низ */
        $latinica = array('dj','lj','nj','dž','Lj','Nj','Dž','a','b','v','g','d','đ','e','ž','z','i','j','k','l','m','n','o','p','r','s','t','ć','u','f','h','c','č','š','A','B','V','G','D','Đ','E','Ž','Z','I','J','K','L','M','N','O','P','R','S','T','Ć','U','F','H','C','Č','Š');	
     
        /* Изврши замену карактера према низу у зависности од тога које се писмо пресловљава. */
      
        $preslov = str_replace($cirilica, $latinica, $text);
		
		/* Испиши пресловљен текст */
        return $preslov;
}

function presloviLAT($text) {
 
    /* Ако постоји унос постави унос као $text. */
   
        /* Ћирилични низ */
        $cirilica = array ('ђ','љ','њ','џ','Љ','Њ','Џ','а','б','в','г','д','ђ','е','ж','з','и','ј','к','л','м','н','о','п','р','с','т','ћ','у','ф','х','ц','ч','ш','А','Б','В','Г','Д','Ђ','Е','Ж','З','И','Ј','К','Л','М','Н','О','П','Р','С','Т','Ћ','У','Ф','Х','Ц','Ч','Ш');
     
        /* Латинични низ */
        $latinica = array('dj','lj','nj','dž','Lj','Nj','Dž','a','b','v','g','d','đ','e','ž','z','i','j','k','l','m','n','o','p','r','s','t','ć','u','f','h','c','č','š','A','B','V','G','D','Đ','E','Ž','Z','I','J','K','L','M','N','O','P','R','S','T','Ć','U','F','H','C','Č','Š');	
     
        /* Изврши замену карактера према низу у зависности од тога које се писмо пресловљава. */
			
            $preslov = str_replace($latinica, $cirilica, $text);
        
        /* Испиши пресловљен текст */
        return $preslov;
}

function preslovljavanje($t, $type){
	//$url = preg_match('/href="(.+)"/',  $t);
	
	$tag='##';
	$newtext2=preg_replace("#((?!\\#\\#)<[^>]*>(?!\\#\\#))#s",$tag."\${1}".$tag,$t);
	$dodatak=explode('##',$newtext2);
	if($type=="cir"){
		for($i=0;$i<count($dodatak);$i++){  
			if($i % 2 == 0){
			$dodatak[$i]=presloviLAT($dodatak[$i]);
			
			}
		}
	}
	if($type=="lat"){
		for($i=0;$i<count($dodatak);$i++){  
			if($i % 2 == 0){
			$dodatak[$i]=presloviCIR($dodatak[$i]);
			
			}
		}
	}
	$a=implode ('##',$dodatak);
	return $a;

}
?>
